{
  "paper_id": "user_added_1766140176",
  "metadata": {
    "title": "random"
  },
  "abstract": [
    {
      "text": "From Failure to the Top\n\nIn his first semester at university, everyone thought Ali was “not made for studies”—including Ali himself. He had failed two core subjects and barely passed the rest. His GPA was the lowest in his class. Each time results were announced, he avoided eye contact, pretending not to care, but inside he felt ashamed and lost.\n\nOne night, after seeing his results again, Ali sat alone in the library. Instead of blaming the system or his teachers, he asked himself one honest qu"
    }
  ],
  "body_text": [
    {
      "text": "From Failure to the Top\n\nIn his first semester at university, everyone thought Ali was “not made for studies”—including Ali himself. He had failed two core subjects and barely passed the rest. His GPA was the lowest in his class. Each time results were announced, he avoided eye contact, pretending not to care, but inside he felt ashamed and lost.\n\nOne night, after seeing his results again, Ali sat alone in the library. Instead of blaming the system or his teachers, he asked himself one honest question: “If I continue like this, where will I end up?” That moment became his turning point.\n\nAli didn’t suddenly become a genius. He started small. He attended every lecture, even when he felt behind. He rewrote his notes after class, asked questions he once felt embarrassed to ask, and practiced problems daily instead of cramming before exams. He failed quizzes along the way, but this time he treated failure as feedback, not proof of weakness.\n\nSlowly, things changed. His grades improved—not dramatically at first, but steadily. By the end of the second year, Ali wasn’t just passing; he was topping assignments. In his final year, something unbelievable happened: Ali graduated with the highest GPA in his department.\n\nWhen asked about his success, he smiled and said,\n“Failure didn’t mean I was incapable. It meant I hadn’t learned how to try properly yet.”\n\nHis story became proof that one bad semester—or even several—does not define a student. Persistence does."
    }
  ]
}